INSERT INTO public.orderdish(
	orderid, dishid, count)
	VALUES 


-- Заказ 2 (1 гость)
(2, 168, 1), -- Солянка
(2, 174, 1), -- Хлеб
(2, 183, 1),  -- Кефир (по  порции)

-- Заказ 3 (2 гостя)
(3, 177, 2), -- Напиток
(3, 169, 2), -- Колбаса (по 2 порции)
(3, 194, 1), -- Картофель отварной обжаренный (по 1 порции)
(3, 193, 1), -- Микс овощной (по 1 порции)

-- Заказ 11 (1 гость)
(5 , 180, 1), -- Десерт "Вишневый пломбир" (по  порции)
(5 , 181, 1), -- Фруктовый коктейль (по  порции)




-- Заказ 6 (2 гостя)
(6, 172, 2), -- Шашлык из птицы (по 3 порции)
(6, 177, 1), -- Напиток
(6, 204, 2), -- Пиво, в ассортименте (по  порции)
(6, 194, 2), -- Картофель отварной обжаренный (по 3 порции)

-- Заказ 3 (4 гостя)
(7, 177, 3), -- Напиток
(7, 202, 3), -- Котлета (по 4 порции)
(7, 194, 3), -- Картофель отварной обжаренный (по 4 порции)

-- Заказ 8 (4 гостя)
(8, 171, 4), -- Шашлык из свинины (по 4 порции)
(8, 177, 4), -- Напиток
(8, 200, 4), -- Картофель жареный соломкой (по 4 порции)
(8 , 174, 2), -- Хлеб "Мамма Миа" (по 2 порции)
(8 , 175, 2), -- Чиабатта (по 2 порции)

-- Заказ 9 (5 гостей)
(9, 177, 5), -- Напиток
(9, 169, 5), -- Колбаса (по 5 порций)
(9, 164, 2), -- Горчица (по 2 порции)
(9, 176, 2), -- Хлеб (по  порции)
(9, 175, 2), -- Чиабатта (по  порции)+
(9, 194, 5), -- Картофель отварной обжаренный (по 5 порций)
(9, 183, 2), -- Кефир (по  порции)

-- Заказ 10 (5 гостей)
(10, 185, 1), -- Блины с начинкой из вишни (по  порции)
(10, 186, 1), -- Блины с творогом (по  порции)
(10, 187, 1), -- Блины с мясом цыпленка (по  порции)
(10, 188, 1), -- Блины с сыром и ветчиной (по  порции)
(10, 189, 1), -- Блины с яблоками и клюквой (по  порции)
(10, 177, 3), -- Напиток
(10, 182, 5), -- Сметана (по  порции)
(10, 183, 1), -- Кефир (по  порции)+
(10, 184, 1), -- Йогурт питьевой (по  порции)


-- Заказ 11 (1 гость)
(11 , 180, 1), -- Десерт "Вишневый пломбир" (по  порции)
(11 , 181, 1), -- Фруктовый коктейль (по  порции)

-- Заказ 12 (1 гость)
(12, 167, 1), -- Суп куриный
(12, 177, 1), -- Напиток

-- Заказ 13 (2 гостя)
(13, 170, 2), -- Скумбрия (по 2 порции)
(13, 177, 2), -- Напиток
(13, 196, 2), -- Рис с куркумой (по 2 порции)

-- Заказ 14 (2 гостя)
(14, 172, 2), -- Шашлык из птицы (по 2 порции)
(14, 177, 2), -- Напиток
(14, 194, 2), -- Картофель отварной обжаренный (по 2 порции)
(14, 193, 1), -- Микс овощной (по  порции)

-- Заказ 15 (3 гостя)
(15, 202, 3), -- Котлета (по 3 порции)
(15, 177, 3), -- Напиток
(15, 194, 3), -- Картофель отварной обжаренный (по 3 порции)

-- Заказ 16 (3 гостя)
(16, 171, 1), -- Шашлык из свинины (по 1 порции)
(16, 177, 3), -- Напиток
(16, 200, 2), -- Картофель жареный соломкой (по 3 порции)
(16, 201, 1), -- Картофель отварной с укропом (по  порции)
(16, 202, 1), -- Котлета из свинины (по  порции)
(16, 203, 1), -- Говядина с грибами под сыром (по  порции)

-- Заказ 17 (4 гостя)
(17, 191, 4), -- Блины, 2 шт (по  порции)
(17, 178, 2), -- Топпинг клубничный (по  порции)
(17, 179, 2), -- Аджика "Домашняя" (по  порции)
(17, 177, 4), -- Напиток
(17, 194, 2), -- Картофель отварной обжаренный (по 4 порции)

-- Заказ 18 (4 гостя)
(18, 169, 1), -- Колбаса "Куриная с майораном" жареная (по  порции)
(18, 170, 1), -- Скумбрия гриль (по  порции)
(18, 171, 1), -- Шашлык из свинины "Фирменный" (по  порции)
(18, 172, 1), -- Шашлык из птицы "Оригинальный" (по  порции)
(18, 177, 4), -- Напиток
(18, 196, 2), -- Рис с куркумой (по 4 порции)
(18, 199, 2), -- Картофельное пюре (по  порции)

-- Заказ 19 (5 гостей)
(19, 198, 1), -- Драники по-домашнему (по  порции)
(19, 199, 1), -- Картофельное пюре (по  порции)+
(19, 200, 1), -- Картофель жареный соломкой (по  порции)+
(19, 201, 1), -- Картофель отварной с укропом (по  порции)+
(19, 202, 1), -- Котлета из свинины (по  порции)+
(19, 203, 1), -- Говядина с грибами под сыром (по  порции)+
(19, 168, 5), -- Солянка мясная (по  порции)
(19, 204, 5), -- Напиток


-- Заказ 20 (5 гостей)
(20, 180, 5), -- Десерт "Вишневый пломбир" (по  порции)
(20, 181, 5), -- Фруктовый коктейль (по  порции)

-- Заказ 21 (1 гость)
(21 , 181, 1), -- Фруктовый коктейль (по  порции)
(21, 178, 1), -- Топпинг клубничный

-- Заказ 22 (1 гость)
(22, 180, 1), -- Десерт "Вишневый пломбир"
(22, 177, 1), -- Напиток

-- Заказ 23 (2 гостя)
(23, 181, 2), -- Фруктовый коктейль (по 2 порции)

-- Заказ 24 (2 гостя)
(24, 186, 2), -- Блины с творогом (по 2 порции)
(24, 183, 2), -- Напиток

-- Заказ 25 (3 гостя)
(25, 185, 3), -- Блины с начинкой из вишни (по 3 порции)
(25, 182, 3), -- Сметана (по  порции)+
(25, 177, 3), -- Напиток
(25, 184, 1), -- Йогурт питьевой (по  порции)+

-- Заказ 26 (3 гостя)
(26, 190, 3), -- Шампиньоны "Ароматные" (по 3 порции)
(26, 192, 2), -- Стручковая фасоль с морковью и кукурузой (по  порции)\
(26, 195, 1), -- Картофель в кожуре обжаренный (по  порции)
(26, 177, 3), -- Напиток

-- Заказ 27 (4 гостя)
(27, 193, 4), -- Микс овощной (по 4 порции)
(27, 177, 4), -- Напиток

-- Заказ 28 (4 гостя)
(28, 192, 4), -- Стручковая фасоль с морковью и кукурузой (по 4 порции)
(28, 203, 4), -- Говядина с грибами под сыром (по  порции)+
(28, 177, 4), -- Напиток

-- Заказ 29 (5 гостей)
(29, 198, 5), -- Драники по-домашнему (по 5 порций)
(29, 167, 2), -- Суп куриный (по  порции)+
(29, 179, 3), -- Аджика "Домашняя" (по  порции)+
(29, 176, 2), -- Хлеб (по  порции)+
(29, 177, 5), -- Напиток

-- Заказ 30 (5 гостей)
(30, 165, 6), -- Блины с картофелем и грибами (по 5 порций)
(30, 191, 2), -- Блины, 2 шт (по  порции)
(30, 177, 5), -- Напиток
(30, 183, 2), -- Кефир (по  порции)+

-- Заказ 31 (1 гость)
(31, 184, 1), -- Йогурт питьевой (по  порции)+

-- Заказ 32 (2 гостя)
(32, 175, 2), -- Чиабатта (по 2 порции)
(32, 171, 1), -- Шашлык из свинины "Фирменный" (по  порции)+
(32, 172, 1), -- Шашлык из птицы "Оригинальный" (по  порции)+
(32, 177, 2), -- Напиток

-- Заказ 33 (5 гость)
(33, 186, 3), -- Блины с творогом (по  порции)+
(33, 187, 2), -- Блины с мясом цыпленка (по  порции)+
(33, 183, 5), -- Кефир (по  порции)+
(33, 182, 3), -- Сметана (по  порции)+

-- Заказ 34 (5 гостя)
(34, 175, 2), -- Чиабатта (по 2 порции)
(34, 173, 5), -- Окорочка "Ароматные" (по  порции)
(34, 201, 5), -- Картофель отварной с укропом (по  порции)+
(34, 193, 2), -- Микс овощной (по  порции)+
(34, 177, 2) -- Напиток