supplierid,companyname,contactinformation,reliabilityrating,productcategory
1,ЛОГАЛ-БИО ООО,"logal-bio.by, info@logal-bio.by",8,Грибы
4,ИМПЕРИЯ ЗЛАКОВ ТМ СМОРГОНСКИЙ КОМБИНАТ ХЛЕБОПРОДУКТОВ УПП," Беларусь, Гродненская область, Сморгонский район, Сморгонь, Комсомольский переулок, 20",7,Пищевые добавки
5,ВИГОЛ ООО,tastee.by,8,Tastee
6,ПИЩЕВОЙ КОМБИНАТ БЕЛКООПСОЮЗА ЧУП,"220075, город Минск, пр Партизанский 168",6,Продукты питаня
7,ДОБРЫЙ ДЕНЬ ООО,"220140, город Минск, Лещинского 8/4-1",9,Продукты питаня
11,БАКАЛЕЯ МОГИЛЕВ ОАО,"212040, город Могилев, Залуцкого 25",9,Бакалея
12,ИВАСИ-ТОРГ ЧАСТНОЕ ТОРГОВОЕ УНИТАРНОЕ ПРЕДПРИЯТИЕ,"211388, город Орша, Ленина 230Ц",7,Морепродукты
14,ВЕРХНИЙ ЛУГ СООО,"211622, Верхнедвинский район, Партизанская 1, д Янино",6,Молочные продукты
16,ЛЕБУР-ПРОДУКТ-ПЛЮС ООО,"223050, Минский район, Базовская 1Б-2, пос Сухорукие",7,Мясо
17,ЛИДАПИЩЕКОНЦЕНТРАТЫ ОАО,wed4@lidkon.by,5,Брикеты супа
33,КОМВАК ЗАО,"220018, город Минск, Якубовского 30/1",5,Овощи
35,ТРЕЙДХОЛЛПРОЕКТ ООО," 212039, город Могилев, Ровчакова 5 офис 1",9,Фрукты
36,ЛЕПЕЛЬСКИЙ МОЛОЧНОКОНСЕРВНЫЙ КОМБИНАТ ФИЛИАЛОАО ВИТЕБСКИЙ МЯСОКОМБИНАТ," 211099, город Лепель, Борисовский тракт 120",4,Молочные продукты
37,МАГВЮС ООО,"223053, город Минский р-н, 40 лет Победы 23А-113, пос Боровляны",9,Напитки
38,Завод Аливарыя,8 017 239-58-01,10,Напитки
2,АМИФРУТ ООО,www.amifruit.by,7,Мясо
13,МИРАНА ООО,"224005, город Брест, Комсомольская 23/1",8,Консервы
45,Вальдерольд ООО,"ул. Радиальная 52, Минск, Минская область 220070",9,Продукты питаня
3,ЕВРОФОЛИЯ ЧТПУП,"220018, город Минск, Шаранговича 7",9,Мясо
8,ABC ПЛЮС ФИРМА ООО ПРЕДСТАВИТЕЛЬСТВО,"212011, город Могилев, пер Березовский 1",7,Продукты питаня
9,КИТАЙСКИЙ ЧАЙ PEKOE.BY МАГАЗИН ЧТУП АДС-ВОСТОК,"210015, город Витебск, Генерала Белобородова 3-65а (ТДЦ Беларусь)",8,Продукты питаня
10,ОРЕХОВАЯ КОМПАНИЯ ООО,"212040, город Могилев, пер 1-й Южный 21 комн 1",6,Продукты питаня
15,КРАСНЫЙ ПИЩЕВИК ОАО,priemnaya@zefir.by,9,Продукты питаня
32,ABC ПЛЮС ФИРМА ООО ПРЕДСТАВИТЕЛЬСТВО,"220094, город Минск, пер 2-й Велосипедный 30-312",8,Овощи
34,ОВОЩИФРЕШ ЧТУП,"220095, город Минск, Плеханова 56/1",8,Овощи
39,Лиско-плюс ООО," ул. Левкова 24, Минск",9,Молочные продукты
40,Zavodik,"пер. Домашевский 9, Минск, Минская область",9,Молочные продукты
41,Рэчыцкае,@rechitskoe_by,9,Продукты питаня
42,Mad Frog Brewery,8 029 151-94-84,9,Продукты питаня
43,Jungle Brewery,"пер. Первомайский 1, Юзуфово, Минская область",9,Цитрусовые
44,Первая ферма HOPS,"улица Колесникова 38, Минск, Минская область",9,Овощи
46,Сады Придоронья,lidskoe.by,9,Фрукты
